{"contentItems": [{"content": "Epic baptismal fail! Gotta wash away that original sin completely... get behind the ears. "}, {"content": "Happy Thanksgiving everyone! "}, {"content": "Oldie but goodie from The New Yorker: "}, {"content": "I just got a Trans Am. Welcome Burt! "}, {"content": "Very well written, full-length, depressing lowlight reel of @realDonaldTrump to the tune of “We didn’t start the fi… "}, {"content": "Whenever someone says, “I’d love to pick your brain.”, just respond with, “I’d love to eat your liver.”"}, {"content": "A ruthless tyrant and the president of North Korea are engaging in peace talks."}, {"content": "Hells yeah! "}, {"content": "Don’t tell everyone @VitalikButerin! "}, {"content": "As Memorial Day approaches it’s important to remember that no matter how important “they” were, they are dead and y… "}, {"content": "And when asked, “Why are there only one set of footprints at times?”, Jesus replied, “...because you suck, and I ha… "}, {"content": "Just sayin’ "}, {"content": "My favorite April Fool’s promotion. I think they actually give you a book too: "}, {"content": "Enjoy the chocolate bunnies...just as JC intended. "}, {"content": "Sorry man, we’ll send someone... "}, {"content": "This church banner makes it look like JC actually got shot or run over instead of crucified. "}, {"content": "So true. "}, {"content": "This kid is pure badass: "}, {"content": "Says the guy walking around with his emotional support lamb... "}, {"content": "Perfect sign for any bathroom. "}, {"content": "This might change your perspective on mythology. "}, {"content": "Shhhhhhh. "}, {"content": "Is @hitbtc still in business? They seem to have stolen my money."}, {"content": "Think of this as you prepare to commit to a New Years resolution: "}, {"content": "Dark humor is like food, not everyone gets it."}, {"content": "This is a definite watch. First 4 episodes of Bubbleproof are free! "}, {"content": "Love this one: “Three conspiracy theorists walk into a bar...wait, you can’t tell me that’s a coincidence!”"}, {"content": "Almost spilled the beans: "}, {"content": "Topping off today’s crappy news, @tompetty has left the building. A true American legend is gone. Wish we could tra… "}, {"content": "It's disturbing that @realDonaldTrump prioritizes tweeting about low NFL TV ratings &amp; disrespecting people of color over doing his job."}, {"content": ""}, {"content": "Fitting. "}, {"content": "A funny thing happened at the track World Championship in London last Saturday. "}, {"content": "#filecoin @minefilecoin ICO crashed already. 2-day delay, \"500\" errors 4 minutes into ICO. How can you trust them with your files?"}, {"content": "In case you missed it... "}, {"content": "Anthropomorphic paper towels? Why not? "}, {"content": "Hey @realDonaldTrump instead of focusing on un-insuring poor people, why don't you figure out what to do about Nort… "}, {"content": "With me as my witness, if I never fly @united again, it will be too soon. They actually created an even crappier tier of service."}, {"content": "Get ready reality TV. The Juice is loose! "}, {"content": "If you're going to buy Bitcoin or ETH, use Coinbase! It's safe &amp; you'll get $10 w this link. How's that for a shill? "}, {"content": "Twisted, yet likely effective marketing. Nobody likes a quitter! "}, {"content": "So glad that @realDonaldTrump stood up to North Korea...on Twitter. Don't worry, he's got this."}, {"content": "It's interesting to see @realDonaldTrump trying to broaden his base. "}, {"content": "\"Just don't DO it!\"  -Nike "}, {"content": "Why do they do this to themselves? "}, {"content": "I know, I know I'm going to Hell blah blah blah: "}, {"content": "Love is love. "}, {"content": "Brilliant! "}, {"content": "Your mom."}, {"content": "Ha! "}, {"content": "It's funny 'cause it's true. "}, {"content": ""}, {"content": "Worth a click. "}, {"content": "The resurrection of Christ is one of the oldest and most celebrated examples of fake news."}, {"content": "With dignity. "}, {"content": "Is it ok to talk shit about @united without @Twitter censoring it?"}, {"content": "Celebrating Jesus by wearing a cross is like honoring JFK by wearing a sniper rifle. -Bill Hicks (paraphrased)"}, {"content": "The shart of the deal: "}, {"content": "So true! "}, {"content": "\"I find that a duck's opinion of me is overly influenced by whether or not I have bread.\" -Mitch Hedberg"}, {"content": "Now that is the face of a man before a great big fall. "}, {"content": "Pope Francis in da hizzouse! "}, {"content": "His clip-art face says it all.. "}, {"content": "Brilliant! "}, {"content": "Perhaps the best license plate ever. "}, {"content": "Hey @realDonaldTrump, just checking in. Have you thought about replacing @GenFlyn with @kanyewest? Just sayin'."}, {"content": "It's looks like Russia really does have @realDonaldTrump under its thumb. I predict Pence will serve out the term once it all gets released."}, {"content": "Is this fake tan of @realDonaldTrump #fakenews? "}, {"content": "Hahahahahaha @realDonaldTrump! Everyone is laughing at you. Does that make you mad?"}, {"content": "Awesome flag at the women's march in Seattle. "}, {"content": "If only voter turnout reflected the celebrations! "}, {"content": "Overheard this one-liner: \"Seriously, what are the odds of someone named Lou Gehrig getting Lou Gehrig's disease?\""}, {"content": "Oh, sense...it makes! "}, {"content": "Sad as it is for everyone else, at least @GeorgeMichael doesn't have to witness a #Trump inauguration from earth. RIP &amp; thanks George."}, {"content": "How one immigrant (Spokeo CEO Harrison Tang) built a $78 Million company from his parents' basement. "}, {"content": "Yup, this is really the new order. "}, {"content": "Castro's impact on the hipster movement will never be forgotten. "}, {"content": "I NEVER do this, but Wayne is a good man. If you can spare a buck or two: Help Wayne recover from disasters "}, {"content": "A funny pic that has nothing to do with the election: "}, {"content": "We can all learn from this election. For example, I learned that uneducated white men are more sexist than racist."}, {"content": "I've lost a lot of respect for @NateSilver538 and 49% of America."}, {"content": "#beentheredonethat "}, {"content": "Oh my me! @CubsJoeMadd just can't help himself. Had to pull your pitcher."}, {"content": "Has anyone else heard of any rumors of iPhone 7 devices catching fire as well?"}, {"content": "Alec Baldwin kills it with hilarious Donald Trump impression on \"SNL\" ⏩ by @lee_moran "}, {"content": "I ask this with the utmost curiosity and disrespect for the idiots supporting Trump, but are you driven more by misogyny, racism, or low IQ?"}, {"content": "Though not admitting defeat, @realDonaldTrump agrees that he could have told bigger lies &amp; made more sexist remarks with better preparation."}, {"content": "Another black man shot to death by the cops today. Armed or not, can't these fucking cops aim for the knees??"}, {"content": "Seriously, how can anyone vote for such a buffoon like @realDonaldTrump? C'mon SNL will be better, but that is not a good enough reason."}, {"content": "I guess I'll be having two Arnold Palmers with my lunch today!"}, {"content": "Oh my @god! @apple @AppleSupport refuses to help me with &gt;$6,000 in fraud on my account! Fortunately @AskAmex will."}, {"content": "iPhone 7 is not ready for launch. Anyone thinking about ordering today should wait. WORST #apple launch ever. :("}, {"content": "Great iPhone 7 launch @apple! "}, {"content": "\"Whites who do not hold college degrees support Trump by an almost 3-to-1 margin (68% to 24%)\" DUH! Via @CNN"}, {"content": "Creepy toy store bin. "}, {"content": "Scarface school play!! "}, {"content": "Trump's secret to good health...two white babies for breakfast every morning. "}, {"content": "Actual door mat I noticed upon leaving my friend's house this AM. 2 out of 3 ain't bad. "}, {"content": "Sometimes I feel like I'll never catch 'em all."}, {"content": "Touché! "}, {"content": "\"Recently I was walking through a park and a tree fell right in front of me... it didn't make a sound.\" @StevenWright"}, {"content": "Congratulations @KingJames, @cavs, @adambain!!!"}, {"content": "BREAKING: @BernieSanders is accusing @HillaryClinton of using math against him."}, {"content": "Poor @SenSanders, his dementia is getting so bad he keeps forgetting that he lost."}, {"content": "I think it's time for @BernieSanders to change his adult diaper, go home, and enjoy his great-grandchildren."}, {"content": "It's sad that everyone has \"all gender\" bathrooms in their homes already, but Republicans still managed to make this an issue."}, {"content": "So true. "}, {"content": "My son gets crucified, dies (duh) and comes back to life, and you people worship a fucking bunny for Easter?? Nice."}, {"content": "As dad is checking family into hotel, he says \"I hope the porn is disabled.\"  Guy at desk replies, \"It's just regular porn, you sick fuck.\""}, {"content": "Proof that nipple tweakers existed long before J-Lo videos. "}, {"content": "Word on the street is that @tedcruz is going to be dropping out of the race after the next primary!"}, {"content": "I was all like, \"baby, you ain't losing your virginity, your gaining your sexuality\"."}, {"content": "I can't believe people still believe in the \"immaculate conception\". I hit that and it was anything but immaculate when we finished."}, {"content": "In case you were wondering. "}, {"content": "Ok, I'm back. Some jackass hacked my account. I let him play for a day before I had him killed. Sorry for the noise."}, {"content": "It's always the \"P\" that goes out! "}, {"content": "Wow! "}, {"content": "I guess it's only fitting that Peyton Manning close out his career by losing a Super Bowl."}, {"content": "If Gone with the Wind were today... "}, {"content": "I guess he shouldn't have announced his intentions. The ducks were waiting for him. Fuck me? No, duck you! "}, {"content": "I'm sure he'll never be touched in prison. Happy new year! "}, {"content": "Let's make 2016 the year that both #trump and #cosby got what they deserved."}, {"content": "Actually, he already came... "}, {"content": "It's the night before Christmas and Jesus is getting high with Mary Magdalene's younger sister and their sex worker friend. Happy b-day son!"}, {"content": "Crack problem? Feeling uneducated &amp; underemployed? Perhaps a bit racist? Just out of prison and looking for work? TSA is hiring in Seattle!"}, {"content": "I don't know what's worse, the hair or the decision to use it in an ad. "}, {"content": ""}, {"content": "Hope all you sick fucks are enjoying the turkey holocaust."}, {"content": "Pyro kitty! "}, {"content": "Selfie! "}, {"content": "The only good reality TV is amateur porn."}, {"content": "Shit's on fire! "}, {"content": "This is amazing! Computers are now making me and my wrath obsolete: "}, {"content": "Have the sound on for full effect! duck army "}, {"content": "Best Jared Fogle headline so far. "}, {"content": "A rapist, a pothead, and a dog killer walk into a bar... the Steelers must be in town."}, {"content": "From one of my favorite designers... "}, {"content": "Shameful "}, {"content": ""}, {"content": "I needed to upgrade the offense on my flag football team.  Welcome to the club Gifford!!"}, {"content": "Best music video of all time: "}]}