{"contentItems": [{"content": "Falcon fairing halves missed the net, but touched down softly in the water. Mr Steven is picking them up. Plan is t… "}, {"content": "64 satellites 🛰 on this flight! "}, {"content": "None shall pass! "}, {"content": "♥️♥️♥️♥️🛸🛸🛸🛸♥️♥️♥️♥️ "}, {"content": "Boring breakthrough @BoringCompany "}, {"content": "Super fun software Easter eggs coming to all Tesla S/3/X cars before the holidays! Romance mode, toilet humor &amp; more video games."}, {"content": "You can summon your Tesla from your phone. Only short distances today, but in a few years summon will work from acr… "}, {"content": "Cool! Actually, if you buy a Tesla without a test drive, you have 3 days to return it. If you buy after a test driv… "}, {"content": "Join to create exciting new worlds of technology!! If getting things done matters to you, then @SpaceX, @Tesla,… "}, {"content": "For those worried about running out of fresh water, it may help to know that desalination only costs 0.1 cents per… "}, {"content": "Used to live in Silicon Valley, now I live in Silicone Valley"}, {"content": "🖤 trouble"}, {"content": "Earth is"}, {"content": "If you don’t want a Tesla, here’s a list of all electric cars in North America "}, {"content": "🚀 Starships were meant to fly 🚀\n"}, {"content": "Renaming BFR to Starship"}, {"content": "Tesla Supercharger capacity will double by end of next year. Expect to be within range of 95% to 100% of population in all active markets."}, {"content": "Will allow having your car picked up &amp; dropped off or using mobile Tesla Rangers service vans if car lift isn’t nee… "}, {"content": "Adding functionality to Tesla phone app allowing owners to request service for top issues with 1 or 2 taps "}, {"content": "Btw, SpaceX is no longer planning to upgrade Falcon 9 second stage for reusability. Accelerating BFR instead. New d… "}, {"content": "Set air flow to recirculating mode &amp; manually raise blower speed to 5 in Model 3 for best air quality. Air filters… "}, {"content": "Congratulations @BoringCompany on completing the LA/Hawthorne tunnel! Cutting edge technology! "}, {"content": "Boring Company just broke through the other side!!  "}, {"content": "Listening to Better Now "}, {"content": "Sure hope this isn’t true. It is the non-linearities, such as Siberian permafrost melting or ocean currents changin… "}, {"content": "Looking back at the sun from upper stage &amp; Falcon 9 🚀 landed on drone ship Of Course I Still Love You "}, {"content": "The Boring Company is building a watchtower in LA out of dirt bricks &amp; we need a knight to yell insults at people i… "}, {"content": "Tesla just acquired trucking capacity to ensure Model 3 can be delivered in US by Dec 31 if ordered by Nov 30 "}, {"content": "Congratulations @SpaceX team! Thanks @NASA, much appreciated. "}, {"content": "Rest in peace, Stan Lee. The many worlds of imagination &amp; delight you created for humanity will last forever."}, {"content": "It naturally follows that a hotter system will have more energetic events. For example, as a pot of water becomes c… "}, {"content": "We know we’ll run out of dead dinosaurs to mine for fuel &amp; have to use sustainable energy eventually, so why not go… "}, {"content": "If Tesla can help people in California wildfire, please let us know. Model S &amp; X have hospital grade HEPA filters.… "}, {"content": "Please lmk what you’d most like improved/fixed about your Tesla. Thanks!"}, {"content": "Mod to SpaceX tech tree build: Falcon 9 second stage will be upgraded to be like a mini-BFR Ship"}, {"content": "I think Twitter is deleting fake, scam or maybe even inactive accounts. My follower count decreased by ~20k over the past few days."}, {"content": ""}]}