{"contentItems": [{"content": "Look who’s joined WW!!  And here’s her reason why...#MyWhy #OWandWW. For the full conversation, check out… "}, {"content": "Every father has a dream for their family and @DwyaneWade’s dream for Kaavia James is an inspiration for all parent… "}, {"content": ".@ItsGabrielleU and @DwyaneWade dispel many myths of IVF parenting. They want you to know if you’re on a unique pat… "}, {"content": "Why wait until after the holidays to get healthy? Do it now with @WW_US and share the gift of health with everyone… "}, {"content": "This story struck my heart. I’ve done this a 1k times. But will think twice before ever doing again. To J.S. family… "}, {"content": "Roll call! Greenleafers…this is the EXPLOSIVE Season Finale we’ve been building towards for months. Y’all will be S… "}, {"content": "Look who I got to meet! Little Kaavia James, the miracle baby! Couldn’t be happier for @ItsGabrielleU and… "}, {"content": "Did you know that 1 in 8 Americans struggles with hunger? As we head into the holidays, from now until Dec 29, with… "}, {"content": "Seeing all your comments on social &amp; feeling the love that you all have for Michelle. I couldn’t agree with you mor… "}, {"content": "Michelle, I never thought of it that way before but I couldn't agree more. You've shown us that there's not just ON… "}, {"content": "Hey Chicago! I'm sitting down with @MichelleObama tonight to kickoff her #IAmBecoming book tour. Tweet at me a ques… "}, {"content": "From the very first pages of “Becoming” I knew I wanted EVERYONE to read it. I’ve known Michelle for 14 years, but… "}, {"content": "Can you believe it? Halloween is behind us. Elections have passed &amp; we're into “the most wonderful time of the year… "}, {"content": "I woke up feeling compelled to pray for our country. No matter your spiritual practice, I pray that we ALL remain s… "}, {"content": "Michelle &amp; Chad – thank you for opening up and sharing your story with us on OWN. Starting TONIGHT and every Saturd… "}, {"content": "We are all equal in the voting booth. Make your voice heard Nov. 6! \nVOTE! VOTE! VOTE! "}, {"content": "Juuuulia! Our forever pretty woman is coming into a new decade and she is LIVING. This is a side of Julia you’ve ne… "}, {"content": "When people show you are believe them. If they actually Tell you...  #ReadyToLove"}, {"content": "Glad y’all are watching . Your tweets are hilarious🤣 #ReadyToLove"}, {"content": "#ReadyToLove  hey @willpowerpacker !!"}, {"content": "🚨 Going LIVE right NOW with Will Packer on @instagram! 🚨 Head to his Instagram (@WillPowerPacker) to join the conve… "}, {"content": "CALLING ALL GROWN FOLKS! #ReadyToLove series premiere TONIGHT at 10/9c. Since I started OWN I’ve been looking for t… "}, {"content": ".@TinaTurner has been through the fire recently, one challenge after the other, and came out on the other side “ano… "}, {"content": "I have no words for tonight’s episode of #Greenleaf other than Zora, honey child, you better mind your mama! The ne… "}, {"content": "O ye of little faith Sophia!  #Greenleaf"}, {"content": "I think @IyanlaVanzant is doing a great job. Quiet as it’s kept , it’s hard to “play” yourself. #Greenleaf"}, {"content": "Pastor Patti  lookin fressssh!  #Greenleaf"}, {"content": "TONIGHT is ladies night! @MsLynnWhitfield. @MsPattiPatti. @IyanlaVanzant. SO GOOD. 👏🏾 Who’s watching #GREENLEAF wit… "}, {"content": "When you hit rock bottom, time to call on @IyanlaVanzant! Charity (@DeborahJWinans)…you ready, girl?! NEW… "}, {"content": "Two of my favorite things? PIZZA and PARTIES! That’s why I want to send some of my new O That’s Good! pizza to your… "}, {"content": "E’erbody prayin’ , but their hearts not right. #Greenleaf"}, {"content": "Charity @DeborahJWinans needs @Iyanla to help fix her life. #Greenleaf"}, {"content": "You know Mae…now meet Maxine. Double trouble! 💃🏾💃🏾 Welcome to Calvary, @MsPattiPatti. Watch her tonight on a new… "}, {"content": "Get ready for a side of Lady Mae you’ve never seen before. @MsLynnWhitfield is E-V-E-R-Y-THING! New #Greenleaf Toni… "}, {"content": "I think he’s one of the greatest entrepreneurs and CEOs of our time. @JeffWeiner of @LinkedIn shares his personal j… "}, {"content": "Hey @AusOutbackNT I just rewatched that beautiful “Thank You” video you sent 7 yrs ago. Still brings me joy!"}, {"content": "Take your bow on that one.@MsLynnWhitfield 👏🏽👏🏽! #Greenleaf"}, {"content": "“The work of the Lord”? .. mmm 🤔🤔#Greenleaf"}, {"content": "Is Charity homophobic? #Greenleaf"}, {"content": "So happy to see you all here, Greenleafing with us! #Greenleaf"}, {"content": "Let the people say Amen to this WILD new season as we welcome sister Patti LaBelle 👏🏾👏🏾 to our marvelous cast. Two-… "}, {"content": "The wait is FINALLY over, Greenleafers! 🌱 See you TONIGHT for part one of the #GREENLEAF two-night season premiere,… "}, {"content": "As @IyanlaVanzant says, “so many people choose silence over truth.” If your family has ever held a secret, you need… "}, {"content": "It’s time, sweeties. @Ava is giving you an extra spoonful of sugar…90-minute season finale TONIGHT! Lots of surpris… "}, {"content": "You can pick one up at your local grocery store.🍕Find one in your area: "}, {"content": "Bet y’all didn’t know I had hidden pizza talents! Been taste testing a lot of pizza’s to get this just right. The c… "}, {"content": "I have loved watching YOU fall in love with Nuri &amp; Yasir just as I have. Thank you @MaraBrockAkil for giving us thi… "}, {"content": "#HAHN is baaack…as BIG and CRAZEEE as ever! This cast still makes my jaw drop 😱 See you tomorrow. "}, {"content": "We’ll miss you Queen. #ArethaQueenForever "}, {"content": "Go to my kitchen!  I understand Vi. #QueenSugar"}, {"content": "Who’s ready to see some @IyanlaVanzant? Tonight #FixMyLife is new new NEW! And if you love Iyanla, you’ll love Mahi… "}, {"content": "Drama for real! Tonight’s episode left me gasping. It’s a nightmare of meeting “his mama”. Loretta Devine… "}, {"content": "Earlier this summer I sat down with @MitchLandrieu, the former Mayor of New Orleans, who took down Confederate monu… "}, {"content": "Hey @ava  u know it’s a great show when the next day you’re still thinking about the characters. Ra,Nova, Charley still with me.#QueenSugar"}, {"content": "Best season yet. Thanks for hanging in there, #Greenleaf fans. 🙏🏾 Worth the wait. We’re back August 28 &amp; 29. "}, {"content": "LoVE IS __happening on @OWNTV! #LOVEis"}, {"content": "JusT saw #Whitney. Great job @LisaErspamer and Kevin MacDonald and team. Footage we’ve NEVER seen. Fearless doc. "}, {"content": "Thanks  @BritishVogue @edwardenninful @mertalas @macpiggott. for the regal experience,felt like an “Empress 4 a day! "}, {"content": "We’re Live on Facebook! Join us now."}, {"content": "See ya from my porch in 15 minutes. LIVE FB #TheSunDoesShine"}, {"content": "Love this book and the author. Join me FBLive from my with your insights and questions 6pm eastern. "}, {"content": "I do so LOVE me some  #QueenSugar  Thank u forever @ava"}, {"content": "After 30 years of being on death row for a crime he did NOT do, Anthony Ray Hinton is ready to enjoy life. He and b… "}, {"content": "#LOVEis happening now on @OWNTV"}, {"content": "TONIGHT! 10/9c on OWN. See ya there! 👋🏾 #LOVEis "}, {"content": "Maria has been my friend since we were both young reporters in Baltimore. Her wisdom and open heart is what the wor… "}, {"content": "Feeling the love from you all for our new show. Thanks for showing up here and spreading the word. OWNers you Rock! #LOVEis"}, {"content": "Yes regular time slot, after Haves. 10pm #LOVEis"}, {"content": "Remember collect calls y’all?“Heard you walkin around town in your drawers” made me😂#LoveIs"}, {"content": "Thanks for being a part of the TREND y’all! #LOVEis"}, {"content": "Here we go @LoveIsOWN ! Happy to be tweet-resting with you ! #LoveIs"}, {"content": "Everyone needs a little love right now. #LOVEis series premiere TONIGHT 10/9c on OWN. "}, {"content": "Here we go @CBSThisMorning! Eye-opener."}, {"content": "On vacay.. Up to watch @CBSThisMorning.  @GayleKing @DavidBegnaud, @cbsmireya LIVE from Texas!"}, {"content": "Babies torn from their parents.\nCan’t stand it! Will be watching\n@GayleKing and her colleaques LiVE from Texas. @CBSThisMorning 7am"}, {"content": "Father of three, Tom Brady is on an all NEW @SuperSoulSunday today at 11am. Tune-in and tweet, tweet! #HappyFathersDay"}, {"content": "Knew I liked this guy! Much more to Tom Brady than football—so impressed by his work ethic and commitment to family… "}, {"content": "Who loves 90s music?! 👋🏾 Our new show @LoveIsOWN premieres in 1 WEEK! It’s set in the 90s so let’s get in the mood!… "}, {"content": "One of the most incredible men I’ve ever met. Today on the #SuperSoul podcast, Anthony Ray Hinton’s gripping story.… "}, {"content": "Great to hear from all u guys @MalikaGhosh ,@3LWTV ,@RichOnOWN ,@AshBenton ,@kenlikebarbie ! Don’t we 🧡🧡Mr. Hinton.\n#TheSunDoesShine"}, {"content": "Hope u can join me on Facebook or OWN.. in half hr. And meet this remarkable man. "}, {"content": "SuperSoulers, this man is incredible. You’ll see why after this interview. Anthony Ray Hinton, author of my new Boo… "}, {"content": "Seeing everything under one roof brought tears to my eyes. Thanks Lonnie Bunch for giving @GayleKing and I a sneak… "}, {"content": "Wednesday…favorite night of the week! Who’s ready for new #QUEENSUGAR tonight??? "}, {"content": "Going LIVE on Facebook with Gayle and a man you need to know.. Anthony Ray Hinton.. join us at 10:15 "}, {"content": "Book Club friends, I’m SO passionate about my next pick. The Sun Does Shine by Anthony Ray Hinton. This unimaginabl… "}, {"content": "Grammy-Award winning musician, author, philanthropist and “techie”…@iamwill is keeping busy! See what Will’s been u… "}, {"content": "Alright Sugar fans, how are you holding up after last night? Double dose of #QUEENSUGAR continues tonight, 10|9c. F… "}, {"content": "Don’t change Nothin’ #QueenSugar "}, {"content": "Results? #QueenSugar"}, {"content": "Same officer.. that’s for sure! #queensugar"}, {"content": "Come on y’all..#GimmeSugar #SugarTime #QUEENSUGAR  season 3!!! 👏🏽👏🏽👏🏽"}, {"content": "Counting down the hours for new #QUEENSUGAR! Who’s watching with me and @Ava? 👋🏾"}, {"content": "I see you…I KNOW you’re ready, Sweeties! #QUEENSUGAR two-night season premiere event starts this Tuesday, May 29 at… "}, {"content": "Nothing else like it on TV. A new romantic series comes to OWN, June 19. Drum roll, please…here’s your first look a… "}, {"content": "The Bordelons aren’t playing games! Getting close, Sweeties…only two weeks until the two-night season premiere of… "}, {"content": "What’s the #1reason we often repeat our mistakes? @DrPhil is a master at understanding human behavior and helping u… "}, {"content": "We’re baaack! #WrinkleInTime is in theaters again this weekend. Moms and kids, experience the magic together.… "}, {"content": "I have ALWAYS wanted to work with @MaraBrockAkil &amp; @TheSalimAkil and it’s finally happening! Who didn’t love Girlfr… "}, {"content": "Come on, @AmySchumer! 💃🏾 You can catch our conversation on my Facebook page tomorrow. "}, {"content": "We both knew it just had to happen one day. And it finally did. Our first Hellooooo! Go see #IFeelPretty on Friday.… "}, {"content": "A legacy worth fighting for. Season 3 is almost here, sweeties! #QUEENSUGAR "}, {"content": "I read every article. This issue remarkable.Great job.  @NatGeo "}, {"content": "Tonight on @60minutes, we go inside The National Memorial for Peace and Justice. 805 steel markers, each bearing th… "}, {"content": "We could listen to you all day, @Lin_Manuel! Hamilton fans, gather ‘round—our #SuperSoul conversation streams on my… "}, {"content": "A Lot ain’t addin’ up! #FixMyLife"}, {"content": "Let’s just say it @IyanlaVanzant is a mighty, mighty Healer! #FixMyLife"}, {"content": "This right here requires some serious healing and fixin’...getting ready for #FixMyLife tonight 9/8c. "}, {"content": "We all have the power to change someone’s life through our relationships.  I’m really hoping anybody who works with… "}, {"content": "This is one of the most life changing stories I’ve ever done. I hope it starts a Revolution in helping people. Watc… "}, {"content": "Finally! Today’s the day. Are you taking the child in you or bringing a child to see #WrinkleInTime? #DoBoth "}, {"content": "Thanks Google NYC for the special day with these STRONG, SMART, and BOLD girls from @girlsincnyc. Women warriors in… "}, {"content": "With my warrior women at the #WrinkleInTime @O_Magazine Premiere. 2 days! "}, {"content": "So happy and proud for you @JordanPeele ! Thanks again for the great convo.#Oscars90"}, {"content": "Jordan, I’m so proud of you and what you’ve done to build EMPATHY by using story as a “weapon for change.” We’re al… "}, {"content": "Woooow! Lot a B’wordin’ goin on!#fixmylife"}]}