{"contentItems": [{"content": "Medieval Futurism "}, {"content": "Tesla 💨 app almost done. Important to get every note right!"}, {"content": "Tesla is releasing all vehicles for sale today where original customer can’t take delivery before end of year.\n\nRem… "}, {"content": ""}, {"content": "💕🍜 ramen is sooo good🍜 💕"}, {"content": "Important note for US Tesla buyers: Federal tax credit drops by $3750 in 3 weeks. \n\nTo be on the cancellation waitl… "}, {"content": "Love that people are buying a Tesla for the product itself, even if they don’t believe in climate change. \n\nNot eve… "}, {"content": "If you have a Tesla built in past 2 years, definitely try Navigate on Autopilot. It will blow your mind. Automatica… "}, {"content": "Tesla history trivia: we didn’t actually come up with the Tesla Motors name. Bought trademark off Brad Siewert for… "}, {"content": "Boring Company product launch on Dec 18. More than a tunnel opening. Will include modded but fully road legal auton… "}, {"content": "Tracking shot of Falcon water landing "}, {"content": "Engines stabilized rocket spin just in time, enabling an intact landing in water! Ships en route to rescue Falcon. "}, {"content": "Grid fin hydraulic pump stalled, so Falcon landed just out to sea. Appears to be undamaged &amp; is transmitting data. Recovery ship dispatched."}, {"content": "Falcon/Dragon launch to @Space_Station in 9 minutes "}, {"content": "Falcon fairing halves missed the net, but touched down softly in the water. Mr Steven is picking them up. Plan is t… "}, {"content": "64 satellites 🛰 on this flight! "}, {"content": "None shall pass! "}, {"content": "♥️♥️♥️♥️🛸🛸🛸🛸♥️♥️♥️♥️ "}, {"content": "Boring breakthrough @BoringCompany "}, {"content": "Super fun software Easter eggs coming to all Tesla S/3/X cars before the holidays! Romance mode, toilet humor &amp; more video games."}, {"content": "You can summon your Tesla from your phone. Only short distances today, but in a few years summon will work from acr… "}, {"content": "Cool! Actually, if you buy a Tesla without a test drive, you have 3 days to return it. If you buy after a test driv… "}, {"content": "Join to create exciting new worlds of technology!! If getting things done matters to you, then @SpaceX, @Tesla,… "}, {"content": "For those worried about running out of fresh water, it may help to know that desalination only costs 0.1 cents per… "}, {"content": "Used to live in Silicon Valley, now I live in Silicone Valley"}, {"content": "🖤 trouble"}, {"content": "Earth is"}, {"content": "If you don’t want a Tesla, here’s a list of all electric cars in North America "}, {"content": "🚀 Starships were meant to fly 🚀\n"}, {"content": "Renaming BFR to Starship"}, {"content": "Tesla Supercharger capacity will double by end of next year. Expect to be within range of 95% to 100% of population in all active markets."}]}